#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_security_group.testsg: Reading...
data.aws_security_group.testsg: Read complete after 0s [id=sg-0dfd41989c59bfe6a]
aws_instance.ShiTestInstance: Refreshing state... [id=i-061c441df82169dd7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.ShiTestInstance will be updated in-place
  ~ resource "aws_instance" "ShiTestInstance" {
        id                                   = "i-061c441df82169dd7"
        tags                                 = {
            "Name" = "terraform-git-practice"
        }
      ~ vpc_security_group_ids               = [
          + "AllowEC2Connect",
            # (1 unchanged element hidden)
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_security_group.AllowEC2Connect will be created
  + resource "aws_security_group" "AllowEC2Connect" {
      + arn                    = (known after apply)
      + description            = "Allow IP range for SSH via EC2 Connect traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "18.206.107.24/29",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "AllowEC2Connect"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + AllowEC2Connect = "AllowEC2Connect"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @goodySG, Action: `pull_request`*